_posts/javascript/2018-09-17-ajax.html
---
layout: post
title:  Ajax
author: zrg
description:  Ajax 即 Asynchronous JavaScript and XML，是指一种创建交互式网页应用的网页开发技术。
excerpt: 
comments: false
categories: 
- javascript
tags:
- Ajax
---

<p>
感谢您阅读此文，如果您发现任何错误，请发邮件至 zrg1390556487@gmail.com，谢谢！
</p>

<div id="outline-container-orge60be4d" class="outline-2">
<h2 id="orge60be4d"><span class="section-number-2">1</span> AJAX 简介</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
全称：Asynchronous Javascript and XML，由 Javascript+CSS+DOM+XMLHttpRequest+XSTL+XHTML+XML 七种技术组成，其中技术核心是 XMLHttpRequest。

</pre>
</div>
<div id="outline-container-orge709a28" class="outline-3">
<h3 id="orge709a28"><span class="section-number-3">1.1</span> 同步和异步</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
同步：发送方发出数据后，等接收方发回响应以后才发下一个数据包的通讯方式。
异步：发送方发出数据后，不等接收方发回响应，接着发送下个数据包的通讯方式。

</pre>
</div>
</div>
</div>
<div id="outline-container-org900aab2" class="outline-2">
<h2 id="org900aab2"><span class="section-number-2">2</span> XMLHttpRequest</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Ajax 原生代码示例</label><pre class="src src-javascript"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">ajax</span> = {
        <span style="color: #0000ff;">get</span>:<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">url</span>,<span style="color: #a0522d;">func</span>){
        <span style="color: #b22222;">// </span><span style="color: #b22222;">XMLHttpRequest &#29992;&#20110;&#22312;&#21518;&#21488;&#19982;&#26381;&#21153;&#22120;&#20132;&#25442;&#25968;&#25454;   </span>
        <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">xhr</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">XMLHttpRequest</span>();
        xhr.open(<span style="color: #8b2252;">'GET'</span>, url, <span style="color: #008b8b;">true</span>);
        xhr.onreadystatechange = <span style="color: #a020f0;">function</span>() {
        <span style="color: #b22222;">// </span><span style="color: #b22222;">readyState == 4 &#35828;&#26126;&#35831;&#27714;&#24050;&#23436;&#25104;</span>
        <span style="color: #a020f0;">if</span> (xhr.readyState == 4 &amp;&amp; xhr.status == 200 || xhr.status == 304) { 
                <span style="color: #b22222;">// </span><span style="color: #b22222;">&#20174;&#26381;&#21153;&#22120;&#33719;&#24471;&#25968;&#25454;</span>
              fn.call(<span style="color: #008b8b;">this</span>, xhr.responseText);  
        }
    };
    xhr.send();
  },
  <span style="color: #b22222;">// </span><span style="color: #b22222;">data &#24212;&#20026; 'a=a1&amp;b=b1' &#36825;&#31181;&#23383;&#31526;&#20018;&#26684;&#24335;&#65292;&#22312; jquery &#37324;&#22914;&#26524; data &#20026;&#23545;&#35937;&#20250;&#33258;&#21160;&#23558;&#23545;&#35937;&#36716;&#25104;&#36825;&#31181;&#23383;&#31526;&#20018;&#26684;&#24335;</span>
  <span style="color: #0000ff;">post</span>: <span style="color: #a020f0;">function</span> (<span style="color: #a0522d;">url</span>, <span style="color: #a0522d;">data</span>, <span style="color: #a0522d;">fn</span>) {
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">xhr</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">XMLHttpRequest</span>();
    xhr.open(<span style="color: #8b2252;">"POST"</span>, url, <span style="color: #008b8b;">true</span>);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">&#28155;&#21152; http &#22836;&#65292;&#21457;&#36865;&#20449;&#24687;&#33267;&#26381;&#21153;&#22120;&#26102;&#20869;&#23481;&#32534;&#30721;&#31867;&#22411;</span>
    xhr.setRequestHeader(<span style="color: #8b2252;">"Content-Type"</span>, <span style="color: #8b2252;">"application/x-www-form-urlencoded"</span>);  
    xhr.onreadystatechange = <span style="color: #a020f0;">function</span>() {
      <span style="color: #a020f0;">if</span> (xhr.readyState == 4 &amp;&amp; (xhr.status == 200 || xhr.status == 304)) {
        fn.call(<span style="color: #008b8b;">this</span>, xhr.responseText);
      }
    };
    xhr.send(data);
  }
};
</pre>
</div>
</div>
</div>
<div id="outline-container-org71d9007" class="outline-2">
<h2 id="org71d9007"><span class="section-number-2">3</span> jQuery Ajax</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge257531" class="outline-3">
<h3 id="orge257531"><span class="section-number-3">3.1</span> Ajax 参数详解</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>jQuery Ajax 代码格式示例</label><pre class="src src-javascript">$.ajax({
        url: URL, <span style="color: #b22222;">// </span><span style="color: #b22222;">&#21457;&#36865;&#35831;&#27714;&#30340;&#22320;&#22336;&#65288;&#40664;&#35748;&#20026;&#24403;&#21069;&#39029;&#22320;&#22336;)</span>
  type: <span style="color: #8b2252;">"POST"</span>, <span style="color: #b22222;">// </span><span style="color: #b22222;">&#35831;&#27714;&#26041;&#24335;&#65306;post/get/put/delete&#65288;&#40664;&#35748;&#20026;get)</span>
  timeout: 600, <span style="color: #b22222;">// </span><span style="color: #b22222;">&#35831;&#27714;&#36229;&#26102;&#26102;&#38388;&#65292;&#21333;&#20301;&#27627;&#31186;</span>
  async:<span style="color: #008b8b;">true</span>, <span style="color: #b22222;">// </span><span style="color: #b22222;">true&#65292;&#24322;&#27493;&#35831;&#27714;&#65307;false&#65292;&#21516;&#27493;&#35831;&#27714;&#12290;</span>
  cache:<span style="color: #008b8b;">false</span>, <span style="color: #b22222;">// </span><span style="color: #b22222;">true&#65292;&#20174;&#27983;&#35272;&#22120;&#21152;&#36733;&#32531;&#23384;&#65307;false&#65292;&#19981;&#20174;&#27983;&#35272;&#22120;&#21152;&#36733;&#32531;&#23384;</span>
  data: JSON.stringify(stream), <span style="color: #b22222;">// </span><span style="color: #b22222;">&#21457;&#36865;&#21040;&#26381;&#21153;&#22120;&#30340;&#25968;&#25454;&#65292;&#35201;&#27714;&#20026;Object&#25110;String&#31867;&#22411;&#30340;&#21442;&#25968;&#12290;</span>
  dataType: <span style="color: #8b2252;">"json"</span>,<span style="color: #b22222;">// </span><span style="color: #b22222;">&#39044;&#26399;&#26381;&#21153;&#22120;&#36820;&#22238;&#30340;&#25968;&#25454;&#31867;&#22411;&#12290;&#21487;&#29992;&#30340;&#31867;&#22411;&#26377;:xml,html,script,json,jsonp,text</span>
  contentType: <span style="color: #8b2252;">"application/json; charset=utf-8"</span>, <span style="color: #b22222;">// </span><span style="color: #b22222;">&#24403;&#21457;&#36865;&#20449;&#24687;&#33267;&#26381;&#21153;&#22120;&#26102;&#65292;&#20869;&#23481;&#32534;&#30721;&#31867;&#22411;&#12290;&#40664;&#35748;&#20026;"application/x-www-form-urlencoded"&#65292;multipart/form-data&#65306;&#26377;&#26102;&#20505;&#20063;&#20250;&#36825;&#20010;&#65292;&#19978;&#20256;&#19979;&#36733;&#21487;&#33021;&#20250;&#29992;&#21040;&#12290;</span>
  <span style="color: #0000ff;">beforeSend</span>: <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">XMLHttpRequest</span>){
        <span style="color: #b22222;">// </span><span style="color: #b22222;">&#35774;&#32622;&#35831;&#27714;&#22836;,&#21152;&#36733;loading&#30028;&#38754;</span>
  },
  <span style="color: #0000ff;">dataFilter</span>:<span style="color: #a020f0;">function</span>(){ <span style="color: #b22222;">//</span><span style="color: #b22222;">&#32473;Ajax&#36820;&#22238;&#30340;&#21407;&#22987;&#25968;&#25454;&#36827;&#34892;&#39044;&#22788;&#29702;&#30340;&#20989;&#25968;&#12290;&#25552;&#20379;data&#21644;type&#20004;&#20010;&#21442;&#25968;&#12290;data&#26159;Ajax&#36820;&#22238;&#30340;&#21407;&#22987;&#25968;&#25454;&#65292;type&#26159;&#35843;&#29992;jQuery.ajax&#26102;&#25552;&#20379;&#30340;dataType&#21442;&#25968;&#12290;</span>
        <span style="color: #b22222;">// </span>
  },
  global:<span style="color: #008b8b;">false</span>, <span style="color: #b22222;">//</span><span style="color: #b22222;">&#34920;&#31034;&#26159;&#21542;&#35302;&#21457;&#20840;&#23616;ajax&#20107;&#20214;&#12290;&#40664;&#35748;&#20026;true&#12290;</span>
  ifModified:<span style="color: #008b8b;">false</span>, <span style="color: #b22222;">//</span><span style="color: #b22222;">&#20165;&#22312;&#26381;&#21153;&#22120;&#25968;&#25454;&#25913;&#21464;&#26102;&#33719;&#21462;&#26032;&#25968;&#25454;&#12290;&#26381;&#21153;&#22120;&#25968;&#25454;&#25913;&#21464;&#21028;&#26029;&#30340;&#20381;&#25454;&#26159;Last-Modified&#22836;&#20449;&#24687;&#12290;&#40664;&#35748;&#20540;&#26159;false&#65292;&#21363;&#24573;&#30053;&#22836;&#20449;&#24687;&#12290;</span>
  jsonP:<span style="color: #8b2252;">""</span>,<span style="color: #b22222;">// </span><span style="color: #b22222;">&#22312;&#19968;&#20010;jsonp&#35831;&#27714;&#20013;&#37325;&#20889;&#22238;&#35843;&#20989;&#25968;&#30340;&#21517;&#23383;&#12290; </span>
  username:<span style="color: #8b2252;">"zrg"</span>, <span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;&#20110;&#21709;&#24212;HTTP&#35775;&#38382;&#35748;&#35777;&#35831;&#27714;&#30340;&#29992;&#25143;&#21517;&#12290;</span>
  password:<span style="color: #8b2252;">"123456"</span>, <span style="color: #b22222;">//</span><span style="color: #b22222;">&#29992;&#20110;&#21709;&#24212;HTTP&#35775;&#38382;&#35748;&#35777;&#35831;&#27714;&#30340;&#23494;&#30721;&#12290;</span>
  processData:<span style="color: #008b8b;">false</span>, <span style="color: #b22222;">// </span><span style="color: #b22222;">&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#21457;&#36865;&#30340;&#25968;&#25454;&#23558;&#34987;&#36716;&#25442;&#20026;&#23545;&#35937;&#65288;&#20174;&#25216;&#26415;&#35282;&#24230;&#26469;&#35762;&#24182;&#38750;&#23383;&#31526;&#20018;&#65289;&#20197;&#37197;&#21512;&#40664;&#35748;&#20869;&#23481;&#31867;&#22411;"application/x-www-form-urlencoded"&#12290;&#22914;&#26524;&#35201;&#21457;&#36865;DOM&#26641;&#20449;&#24687;&#25110;&#32773;&#20854;&#20182;&#19981;&#24076;&#26395;&#36716;&#25442;&#30340;&#20449;&#24687;&#65292;&#35831;&#35774;&#32622;&#20026;false&#12290;</span>
  scriptCharset:<span style="color: #8b2252;">""</span>, <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21482;&#26377;&#24403;&#35831;&#27714;&#26102;dataType&#20026;"jsonp"&#25110;&#32773;"script"&#65292;&#24182;&#19988;type&#26159;GET&#26102;&#25165;&#20250;&#29992;&#20110;&#24378;&#21046;&#20462;&#25913;&#23383;&#31526;&#38598;(charset)&#12290;&#36890;&#24120;&#22312;&#26412;&#22320;&#21644;&#36828;&#31243;&#30340;&#20869;&#23481;&#32534;&#30721;&#19981;&#21516;&#26102;&#20351;&#29992;&#12290;</span>
  <span style="color: #0000ff;">complete</span>: <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">XMLHttpRequest</span>, <span style="color: #a0522d;">textStatus</span>){ <span style="color: #b22222;">// </span><span style="color: #b22222;">&#35831;&#27714;&#23436;&#25104;&#21518;&#35843;&#29992;&#30340;&#22238;&#35843;&#20989;&#25968;&#65288;&#35831;&#27714;&#25104;&#21151;&#25110;&#22833;&#36133;&#26102;&#22343;&#35843;&#29992;&#65289;</span>
        <span style="color: #b22222;">// </span>
  },
  <span style="color: #0000ff;">success</span>: <span style="color: #a020f0;">function</span> (<span style="color: #a0522d;">data</span>,<span style="color: #a0522d;">textStatus</span>) { <span style="color: #b22222;">// </span><span style="color: #b22222;">&#35831;&#27714;&#25104;&#21151;&#21518;&#35843;&#29992;&#30340;&#22238;&#35843;&#20989;&#25968;&#65292;&#26377;&#20004;&#20010;&#21442;&#25968;: (1)&#30001;&#26381;&#21153;&#22120;&#36820;&#22238;&#65292;&#24182;&#26681;&#25454;dataType&#21442;&#25968;&#36827;&#34892;&#22788;&#29702;&#21518;&#30340;&#25968;&#25454;;(2)&#25551;&#36848;&#29366;&#24577;&#30340;&#23383;&#31526;&#20018;&#12290;</span>
        <span style="color: #a020f0;">if</span> (data.success) {
                <span style="color: #b22222;">//</span>
      } <span style="color: #a020f0;">else</span> {
        <span style="color: #b22222;">//</span>
      }
  },
  <span style="color: #0000ff;">error</span>: <span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">XMLHttpRequest</span>, <span style="color: #a0522d;">textStatus</span>, <span style="color: #a0522d;">errorThrown</span>){ <span style="color: #b22222;">// </span><span style="color: #b22222;">&#35831;&#27714;&#22833;&#36133;&#26102;&#34987;&#35843;&#29992;&#30340;&#20989;&#25968;&#12290;&#26377;3&#20010;&#21442;&#25968;&#65292;&#21363;XMLHttpRequest&#23545;&#35937;&#12289;&#38169;&#35823;&#20449;&#24687;&#12289;&#25429;&#33719;&#30340;&#38169;&#35823;&#23545;&#35937;(&#21487;&#36873;)&#12290;</span>
        <span style="color: #b22222;">//</span>
  }
});
</pre>
</div>
</div>
</div>
<div id="outline-container-org3fbdae6" class="outline-3">
<h3 id="org3fbdae6"><span class="section-number-3">3.2</span> 常见的 POST 提交数据方式</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li><p>
application/x-www-form-urlencoded
</p>
<pre class="example">
浏览器的原生 &lt;form&gt; 表单，如果不设置 enctype 属性，那么最终就会以 application/x-www-form-urlencoded 方式提交数据。

</pre></li>
<li><p>
multipart/form-data
</p>
<pre class="example">
一般用来上传文件

</pre></li>
<li><p>
application/json
</p>
<pre class="example">
该方案可以方便的提交复杂的数据结构，特别适合 RESTful 的接口。

</pre></li>
<li><p>
text/xml
</p>
<pre class="example">
XML 结构传输。
XML-RPC（XML Remote Procedure Call），它是一种使用 HTTP 作为传输协议，XML 作为编码方式的远程调用规范。它的使用也很
广泛，如 WordPress 的 XML-RPC Api，搜索引擎的 ping 服务等等。

</pre></li>
</ol>
</div>
</div>
<div id="outline-container-orge6b99d6" class="outline-3">
<h3 id="orge6b99d6"><span class="section-number-3">3.3</span> 提交 Form 表单(包括文件上传)</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org700c795" class="outline-4">
<h4 id="org700c795"><span class="section-number-4">3.3.1</span> 常规方法</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>一般是这样的</label><pre class="src src-js">$.ajax({
        url:<span style="color: #8b2252;">"${pageContext.request.contextPath}/public/testupload"</span>,
    type:<span style="color: #8b2252;">"post"</span>,
    data:{username:username},
    <span style="color: #0000ff;">success</span>:<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">data</span>){
        window.clearInterval(timer);
        <span style="color: #b22222;">//</span>
    },
    <span style="color: #0000ff;">error</span>:<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">e</span>){
        <span style="color: #b22222;">//</span>
    }
});

<span style="color: #b22222;">// </span><span style="color: #b22222;">&#25110;&#32773;&#21333;&#19968;&#33719;&#21462;</span>
<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">username</span> = $(<span style="color: #8b2252;">"#username"</span>).val();
<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">password</span> = $(<span style="color: #8b2252;">"#password"</span>).val();
...
</pre>
</div>
<p>
// 以上方式，如果数量少的话，那还没有什么，但是如果数据十分大的话，那就十分的麻烦。
</p>
</div>
</div>
<div id="outline-container-org29756f7" class="outline-4">
<h4 id="org29756f7"><span class="section-number-4">3.3.2</span> 使用 FormData 对象</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
// 下面就介绍提高开发效率的方法
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>使用 FormData 对象（XMLHttpRequest）</label><pre class="src src-js"><span style="color: #b22222;">// </span><span style="color: #b22222;">FormData&#23545;&#35937;&#26159;html5&#30340;&#19968;&#20010;&#23545;&#35937;&#65292;&#30446;&#21069;&#30340;&#19968;&#20123;&#20027;&#27969;&#30340;&#27983;&#35272;&#22120;&#37117;&#24050;&#32463;&#20860;&#23481;&#12290;</span>
<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">form</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">FormData</span>();
form.append(<span style="color: #8b2252;">"username"</span>,<span style="color: #8b2252;">"zxj"</span>);
form.append(<span style="color: #8b2252;">"password"</span>,123456);
<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">req</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">XMLHttpRequest</span>();
req.open(<span style="color: #8b2252;">"post"</span>, <span style="color: #8b2252;">"${pageContext.request.contextPath}/public/testupload"</span>, <span style="color: #008b8b;">false</span>);
req.send(form);
</pre>
</div>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>使用 FormData 对象（jQuery Ajax）</label><pre class="src src-js"><span style="color: #a020f0;">var</span> <span style="color: #a0522d;">form</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">FormData</span>();
form.append(<span style="color: #8b2252;">"username"</span>,<span style="color: #8b2252;">"zxj"</span>);
form.append(<span style="color: #8b2252;">"password"</span>,123456);
$.ajax({
        url:<span style="color: #8b2252;">"${pageContext.request.contextPath}/public/testupload"</span>,
    type:<span style="color: #8b2252;">"post"</span>,
    data:form,
    processData:<span style="color: #008b8b;">false</span>,
    contentType:<span style="color: #008b8b;">false</span>,
    <span style="color: #0000ff;">success</span>:<span style="color: #a020f0;">function</span>(<span style="color: #a0522d;">data</span>){
        window.clearInterval(timer);
            <span style="color: #b22222;">//</span>
    }
});
</pre>
</div>
</div>
</div>
<div id="outline-container-org377090b" class="outline-4">
<h4 id="org377090b"><span class="section-number-4">3.3.3</span> 使用 jQuery.form.js</h4>
<div class="outline-text-4" id="text-3-3-3">
<pre class="example">
具体参考https://github.com/jquery-form/form

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org230c7c9" class="outline-2">
<h2 id="org230c7c9"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://baike.baidu.com/item/ajax">Ajax 百度百科</a></li>
<li><a href="https://blog.csdn.net/qq_27093465/article/details/49799341">$.ajax({});的各个参数的理解</a></li>
<li><a href="https://www.cnblogs.com/zhuxiaojie/p/4783939.html">使用ajax提交form表单，包括ajax文件上传</a></li>
</ul>
</div>
</div>
